Realizando import da biblioteca panda.

In [3]:
import pandas as pd

Criando o DataFrame/Tabela

In [4]:
dados = {
    "Nome": ["Isaque", "Leticia", "Ivone"],
    "Idade": [18, 16, 40],
}
df = pd.DataFrame(dados)
df

      Nome  Idade
0   Isaque     18
1  Leticia     16
2    Ivone     40

Testando algumas operações.

In [5]:
df.head()

      Nome  Idade
0   Isaque     18
1  Leticia     16
2    Ivone     40

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nome    3 non-null      object
 1   Idade   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [7]:
df.describe()

           Idade
count   3.000000
mean   24.666667
std    13.316656
min    16.000000
25%    17.000000
50%    18.000000
75%    29.000000
max    40.000000

In [8]:
df["Nome"]

0     Isaque
1    Leticia
2      Ivone
Name: Nome, dtype: object

In [9]:
df.loc[0]

Nome     Isaque
Idade        18
Name: 0, dtype: object

In [10]:
df.loc[1]

Nome     Leticia
Idade         16
Name: 1, dtype: object

In [11]:
df.loc[2]

Nome     Ivone
Idade       40
Name: 2, dtype: object

In [12]:
df.iloc[2]

Nome     Ivone
Idade       40
Name: 2, dtype: object

Series/Coluna

In [14]:
s = pd.Series([10, 20, 30])
s

0    10
1    20
2    30
dtype: int64

Lendo csv

In [16]:
df = pd.read_csv('teste.csv')
df

      Nome  Idade          Cidade  Salário
0      Ana     23       São Paulo     3500
1    Bruno     30  Rio de Janeiro     4200
2   Carlos     25        Curitiba     3100
3  Daniela     28  Belo Horizonte     5000
4  Eduardo     35    Porto Alegre     4400

Lendo excel

In [42]:
df = pd.read_excel('dados_teste.xlsx')
df

      Nome  Idade          Cidade  Salário
0      Ana     23       São Paulo     3500
1    Bruno     30  Rio de Janeiro     4200
2   Carlos     25        Curitiba     3100
3  Daniela     28  Belo Horizonte     5000
4  Eduardo     35    Porto Alegre     4400

In [34]:
df [['Nome', 'Cidade']]

      Nome          Cidade
0      Ana       São Paulo
1    Bruno  Rio de Janeiro
2   Carlos        Curitiba
3  Daniela  Belo Horizonte
4  Eduardo    Porto Alegre

In [38]:
df ['Idade']

0    23
1    30
2    25
3    28
4    35
Name: Idade, dtype: int64

Séries Booleanas e filtros

In [39]:
df['Idade'] > 30

0    False
1    False
2    False
3    False
4     True
Name: Idade, dtype: bool

In [ ]:
df[df['Idade'] > 30]

      Nome  Idade        Cidade  Salário
4  Eduardo     35  Porto Alegre     4400

In [45]:
df[df['Salário'] > 3500]

      Nome  Idade          Cidade  Salário
1    Bruno     30  Rio de Janeiro     4200
3  Daniela     28  Belo Horizonte     5000
4  Eduardo     35    Porto Alegre     4400

Combinando filtros

In [46]:
filtro_maior_que_trintra = df['Idade'] > 30
filtro_maior_de_4mil = df['Salário'] > 4000

df[filtro_maior_de_4mil & filtro_maior_de_4mil]

      Nome  Idade          Cidade  Salário
1    Bruno     30  Rio de Janeiro     4200
3  Daniela     28  Belo Horizonte     5000
4  Eduardo     35    Porto Alegre     4400

Criando e removendo colunas

In [47]:
df ['Salário Anual'] = df ['Salário'] * 12
df

      Nome  Idade          Cidade  Salário  Salário Anual
0      Ana     23       São Paulo     3500          42000
1    Bruno     30  Rio de Janeiro     4200          50400
2   Carlos     25        Curitiba     3100          37200
3  Daniela     28  Belo Horizonte     5000          60000
4  Eduardo     35    Porto Alegre     4400          52800

In [48]:
df = df.drop('Salário Anual', axis=1)
df

      Nome  Idade          Cidade  Salário
0      Ana     23       São Paulo     3500
1    Bruno     30  Rio de Janeiro     4200
2   Carlos     25        Curitiba     3100
3  Daniela     28  Belo Horizonte     5000
4  Eduardo     35    Porto Alegre     4400

Resumindo dados

In [50]:
df.describe()

           Idade      Salário
count   5.000000     5.000000
mean   28.200000  4040.000000
std     4.658326   750.333259
min    23.000000  3100.000000
25%    25.000000  3500.000000
50%    28.000000  4200.000000
75%    30.000000  4400.000000
max    35.000000  5000.000000

In [51]:
df['Salário'].sum()

np.int64(20200)

In [52]:
df['Salário'].mean()

np.float64(4040.0)

Limpeza de Dados

In [66]:
df = pd.read_csv('dados_teste_nulos.csv')
df

    ID      Nome  Idade          Cidade  Salário
0    1       Ana   23.0       São Paulo   3500.0
1    2     Bruno   30.0  Rio de Janeiro   4200.0
2    3    Carlos    NaN        Curitiba   3100.0
3    4   Daniela   28.0  Belo Horizonte      NaN
4    5   Eduardo   35.0    Porto Alegre   4400.0
5    6  Fernanda   26.0             NaN   3900.0
6    7   Gustavo   31.0   Florianópolis      NaN
7    8    Helena    NaN          Recife   4700.0
8    9      Igor   29.0        Salvador   3600.0
9   10     Julia   24.0             NaN   3300.0
10  11     Karla   32.0           Natal   4100.0
11  12     Lucas   27.0          Manaus      NaN
12  13    Marina    NaN           Belém   3800.0
13  14   Nicolas   33.0       Fortaleza   4500.0
14  15    Otávio   36.0             NaN   4000.0

In [54]:
df.dropna()

    ID     Nome  Idade          Cidade  Salário
0    1      Ana   23.0       São Paulo   3500.0
1    2    Bruno   30.0  Rio de Janeiro   4200.0
4    5  Eduardo   35.0    Porto Alegre   4400.0
8    9     Igor   29.0        Salvador   3600.0
10  11    Karla   32.0           Natal   4100.0
13  14  Nicolas   33.0       Fortaleza   4500.0

In [55]:
df.dropna(subset="Idade")

    ID      Nome  Idade          Cidade  Salário
0    1       Ana   23.0       São Paulo   3500.0
1    2     Bruno   30.0  Rio de Janeiro   4200.0
3    4   Daniela   28.0  Belo Horizonte      NaN
4    5   Eduardo   35.0    Porto Alegre   4400.0
5    6  Fernanda   26.0             NaN   3900.0
6    7   Gustavo   31.0   Florianópolis      NaN
8    9      Igor   29.0        Salvador   3600.0
9   10     Julia   24.0             NaN   3300.0
10  11     Karla   32.0           Natal   4100.0
11  12     Lucas   27.0          Manaus      NaN
13  14   Nicolas   33.0       Fortaleza   4500.0
14  15    Otávio   36.0             NaN   4000.0

In [69]:
media_idade = df['Idade'].mean()
df['Idade'] = df['Idade'].fillna(media_idade)
df

    ID      Nome  Idade          Cidade  Salário
0    1       Ana   23.0       São Paulo   3500.0
1    2     Bruno   30.0  Rio de Janeiro   4200.0
2    3    Carlos   29.5        Curitiba   3100.0
3    4   Daniela   28.0  Belo Horizonte      NaN
4    5   Eduardo   35.0    Porto Alegre   4400.0
5    6  Fernanda   26.0             NaN   3900.0
6    7   Gustavo   31.0   Florianópolis      NaN
7    8    Helena   29.5          Recife   4700.0
8    9      Igor   29.0        Salvador   3600.0
9   10     Julia   24.0             NaN   3300.0
10  11     Karla   32.0           Natal   4100.0
11  12     Lucas   27.0          Manaus      NaN
12  13    Marina   29.5           Belém   3800.0
13  14   Nicolas   33.0       Fortaleza   4500.0
14  15    Otávio   36.0             NaN   4000.0

In [70]:
df['Idade'] = df['Idade'].astype(int)
df

    ID      Nome  Idade          Cidade  Salário
0    1       Ana     23       São Paulo   3500.0
1    2     Bruno     30  Rio de Janeiro   4200.0
2    3    Carlos     29        Curitiba   3100.0
3    4   Daniela     28  Belo Horizonte      NaN
4    5   Eduardo     35    Porto Alegre   4400.0
5    6  Fernanda     26             NaN   3900.0
6    7   Gustavo     31   Florianópolis      NaN
7    8    Helena     29          Recife   4700.0
8    9      Igor     29        Salvador   3600.0
9   10     Julia     24             NaN   3300.0
10  11     Karla     32           Natal   4100.0
11  12     Lucas     27          Manaus      NaN
12  13    Marina     29           Belém   3800.0
13  14   Nicolas     33       Fortaleza   4500.0
14  15    Otávio     36             NaN   4000.0

In [71]:
df = pd.read_csv('teste.csv')

Ordenando dados

In [72]:
df.sort_values(by='Salário', ascending=False)

      Nome  Idade          Cidade  Salário
3  Daniela     28  Belo Horizonte     5000
4  Eduardo     35    Porto Alegre     4400
1    Bruno     30  Rio de Janeiro     4200
0      Ana     23       São Paulo     3500
2   Carlos     25        Curitiba     3100

In [73]:
df.sort_values(by='Salário')

      Nome  Idade          Cidade  Salário
2   Carlos     25        Curitiba     3100
0      Ana     23       São Paulo     3500
1    Bruno     30  Rio de Janeiro     4200
4  Eduardo     35    Porto Alegre     4400
3  Daniela     28  Belo Horizonte     5000